import { harchevMain, harchevMenu } from '../../scripts/index';
import { harchevImages } from '../../images/image';

export const HarchevHome = () =>
    <div>
        <h2>Харчевня</h2>
        <article className="building-index">
            <img src={"/" + harchevImages.harchevLogo} alt="logo" id="building-logo" />
            <div className="description" id="harchev-main-text"></div>
        </article>
        {harchevMain()}
    </div>;


export const HarchevAbout = () =>
    <div>
        <h2>Про харчевню</h2>
        <article className="building-about">
            <p>«Харчевня» - це підприємство ресторанного господарства спеціалізуються на українській кухні. У меню підприємства «Харчевня» представлені страви української кухні, у залах є wi-fi. Сьогодні «Харчевня» - нове підприємство у Готельному комплексі Рокслолани яка показує, що демократичні ціни та якісні продукти можуть співіснувати разом.</p>
            <img
                src={'/' + harchevImages.harchevLogoAbout}
                alt="logo-about"
                className="building-about-img"
            />
            <p>Сам інтер’єр закладу у українському стилі:
                <ul>
                    <li>на стінах висять віночки з польових трав та засушених плодів;</li>
                    <li>столи прикрашені рушниками,які несуть практичне значення;</li>
                    <li>стіні, підлога та стеля виконані з дерева та прикрашені різьбою;</li>
                </ul>
            </p>
            <p>Інші колоритні речі будуть використовуватися для подачі страв, наприклад глечики для борщу з пампушками, а хліб буде подаватися у плетінках - маленьких корзинках, які виконані з лози. Дерев’яні стільці будуть прикрашені м’якими в’язальними килимками з рогожки. Дерев’яні вішалки та канделябри будуть також прикрашені різьбою по дереву, а прикрашені дверні отвори білими рушниками з червоними квітами будуть давати затишок.</p>
            <p>У весь зал буде прикрашений квітами та цікавими знаряддями праці, які використовувалися нашими пращурами здавна. Ручка дверей буде виконана у вигляді серпу, а старе колесо буде використовуватися як вішалка для одягу.</p>
            <p>Основним плюсом закладу є демократичні ціни для якісних страв тому, що не кожна людина може собі дозволити дорогі страви. Але споживання їжі є не від’ємною частиною людського життя. Завдяки різноманітному асортименту та повноцінному харчуванню харчевня займе значиме місце серед усіх закладів «Роксолани». Представлені різні холодні закуски та страви, смачні солодкі страви та гарячі перші страви – це все необхідно людини для гарного самопочуття.</p>
            <img
                src={'/' + harchevImages.harchevHall}
                alt="hall"
                className="building-about-img"
            />
            <p>Концепція «Харчевні» дуже цікава тому, що у закладі співіснують протилежні речі, як добробут сільського подвір’я та комфорт, який дає нам цивілізація. Основним розважальним аспектом закладу є живий сільський двір, на якому можна подивитись та погодувати тварин, звичних для нашого українського колориту. По подвір’ю буде бігати каченята за качкою, у загоні будуть сидіти кабанчики та свинки, а у маленькому водоймі будуть плавати рибки різних розмірів та видів.</p>
            <img
                src={'/' + harchevImages.harchevByk}
                alt="hall"
                className="building-about-img"
            />
            <p>Можна сфотографуватися на пам’ять з нашими конячками, а зона BBQ для відпочинку на свіжому повітрі даруватиме вам незабутні вечори з вашими рідними та друзями.</p>
            <img
                src={'/' + harchevImages.harchevHorses}
                alt="hall"
                className="building-about-img"
            />
            <p>Гарний відпочинок для всієї родини саме у нашому закладі.</p>
            <p>Візитною карткою кожного закладу є його меню. У нашому меню ви знайдете різноманітні страви з птиці, риби, м’яса та традиційні українські вінички.</p>
            <p>За останній час дуже популярною є культура BBQ, тому що недільний ярмарок м’яса забезпечить вам гарний відпочинок, та драйвовий настрій.</p>
        </article>
    </div>;


export const HarchevMenu = () =>
    <div className="list-menu" id="harchev-menu">
        {harchevMenu()}
    </div>;